//金字塔
//时间限制：C / C++语言 1000MS；其他语言 3000MS
//内存限制：C / C++语言 65536KB；其他语言 589824KB
//题目描述：
//想象一个金字塔形的正四面体，其有四个顶点和六条棱（边）。如果我们把它看成一张图，可以像这样描述：
//
//四个顶点分别为S, A, B, C
//
//六条边分别为(S, A)(S, B)(S, C)(A, B)(A, C)(B, C)
//
//简单来说，是一张四个点的完全图。
//
//现在，有一个很简单的问题等你来解答：你从S点开始，沿着边走K次，回到S点的不同走法有多少种？
//
//（默认每步只能走一条边，同一条边可以走无限次）
//
//输入
//输入一个数K，代表你走的步数
//
//输出
//输出一个数，代表不同的方案数对1000000007(109 + 7)取模后的结果
//
//
//样例输入
//3
//样例输出
//6
//
//提示
//范围
//0 <= K <= 1000000
//
//样例解释：
//S - A - B - S
//S - B - A - S
//S - A - C - S
//S - C - A - S
//S - B - C - S
//S - C - B - S


#include <iostream>

using namespace std;

int main()
{
	int k;
	cin >> k;

	long A = 1, B = 1, C = 1, S = 0;
	long a = 1, b = 1, c = 1, s = 0;

	k--;
	while (k--) {
		A = (a * 2 + S) % 1000000007;
		//B = a * 2 + s;
		//C = a * 2 + s;
		S = (a * 3) % 1000000007;
		a = A;
		//b = a;
		//c = a;
		//s = S % 1000000007;

		//cout<<k<<":"<<a<<" "<<b<<" "<<c<<" "<<s<<endl;
	}

	cout << (S % 1000000007) << endl;

	return 0;
}
