//xÖ»ÄÜÍ¨¹ı¼õÒ»ºÍ * 2½øĞĞ±ä»»y£¬¸ø¶¨xºÍy£¬Çóx±ä³ÉyµÄ×î¶Ì²½Êı


//X = 2, Y = 3
//* 2, -1
//
//2 * 2 = 4
//4 - 1 = 3
//
//2 - 1 = 1
//1 * 2 = 2
//2 * 2 = 4
//4 - 1 = 3
//
//X = 2, Y = 5
//
//
//Y->X
/// 2, +1
//
//

//´Óx±ä³Éy£¬ÎŞ·¨ÅĞ¶ÏÏÈ½øĞĞ¼õ1»¹ÊÇ³Ë2²Ù×÷£¬ÒòÎª³Ë2¿ì£¬µ«ÊÇ³Ë2¿ÉÄÜ»á³¬¹ıy£¬¼õÈ¥1µÄ´ÎÊı¾Í±ä¶àÁË£¬µ«ÊÇ
//ÓÖ²»ÖªµÀÏÈ¼õ¼¸´Î£¬ÄÇÃ´ÎÒÃÇÈ¥ÏëÈ¥¼õ¼¸´ÎÄØ£¿Ó¦¸Ã¼õµ½yµÄÒ»°ëÔÙÈ¥³Ë2×î¿ì£¬ËùÒÔÎÒÃÇ¾ÍÏëµ½ÁËµ¹×Å×ö£¬°Ñ
//y±ä³Éx£¬ÄÇÃ´¶ÔyÖ»ÒªÏÈ²»¶Ï½øĞĞ³ıÒÔ2µÄ²Ù×÷£¨Åöµ½ÆæÊıÒª¼Ó1£©£¬Ò»Ö±³ıµ½±ä³É±ÈxĞ¡µÄµÚÒ»¸öÊız£¬´ËÊ±ÎÒÃÇ
//ÔÙ¼ÓÉÏxºÍzÖ®¼äµÄ²îÖµ¼´¿É
class Solution
{
public:
	int minstep(int x, int y)
	{
		int step = 0;
		while (y>x)
		{
			if (y & 0x1)
			{
				++y;
				++step;
			}
			y /= 2;
			++step;
		}
		step = x - y + step;
		return step;
	}
};